[{
    "make": "Mercedes", 
    "model": "c63",
    "year": "2020", 
    "image": "https://i.imgur.com/bzxSnUU.jpg",
    "engine": "V8",
    "transmission": "auto",
    "price": "$75,000",
    "mileage": "42,444",
    "description": "It's getting harder to find a car in the compact-luxury class with ridiculous levels of performance. So we should all be happy for the existence of the 2020 Mercedes-AMG C63, the hot-rod version of the Mercedes-Benz C-class. It's available as a sedan, coupe, or convertible, and every one of them comes with a twin-turbocharged V-8 engine hand-built by engineers in Affalterbach, Germany. The regular C63 makes 469 horsepower, while the C63 S is tuned to make 503 hp. Either way, this car gathers speed in gobs and promises to bring excitement to your humdrum commute. We could do without the harsh ride, but the C63 is so much fun you might not care."
}, {
    "make": "Mercedes", 
    "model": "G 63",
    "year": "2019", 
    "image": "https://i.imgur.com/nCiN5n3.jpg",
    "engine": "V8 Turbo",
    "transmission": "auto",
    "price": "$187,975",
    "mileage": "14,762",
    "description": "The 2019 Mercedes-AMG G63 still has the incredible off-road capability and trail-ready equipment found on the Mercedes-Benz G550, but it also has a more powerful twin-turbo 4.0-liter V-8 that makes 577 horsepower and 627 lb-ft of torque."
}, {
    "make": "Audi", 
    "model": "R8",
    "year": "2020", 
    "image": "https://i.imgur.com/mzP6X4g.jpg",
    "engine": "V10",
    "transmission": "auto",
    "price": "$172,850",
    "mileage": "19,250",
    "description": "Although it shares its powertrain and mechanicals with the Lamborghini Huracán, the 2020 Audi R8 is less sharp-edged and surprisingly easy to live with day to day. Behind the passenger compartment is a raucous V-10 engine that makes as much as 602 horsepower depending on which version you choose and literally howls when prodded. Acceleration is appropriately expeditious but the R8's ride and handling favors a more comfortable nature, making it less competent for track days but appreciated on road trips. The R8's interior is nearly as striking as its bodywork, with an all-digital gauge display, soft leather with optional quilted stitching, and real carbon-fiber trim."
}, {
    "make": "Shelby", 
    "model": "GT500 Super Snake",
    "year": "2018", 
    "image": "https://i.imgur.com/BJ8v1J5.jpg",
    "engine": "Super-Charged V8",
    "transmission": "Manual",
    "price": "$111,111",
    "mileage": "55,555",
    "description": "The 2018 Shelby Super Snake housed a 5.0-liter Coyote V8 beneath its hood, which was offered with a consumer’s choice of two different superchargers. When equipped with a Ford Performance supercharger, the Super Snake’s overall output was bolstered to 710 horsepower. However, those with a penchant for speed could choose to have their Shelby outfitted with a much larger Whipple supercharger, further increasing this output to a total of 800-plus horsepower."
}, {
    "make": "Nissan", 
    "model": "Skyline R34 Nismo Z-Tune",
    "year": "2005", 
    "image": "https://i.imgur.com/ahC86fY.jpg",
    "engine": "I6",
    "transmission": "Manual",
    "price": "$400,000",
    "mileage": "66,000",
    "description": "The Nissan Skyline GT-R is an iconic Japanese sports coupe in the Nissan Skyline range. Dubbed Godzilla by Wheels magazine in Australia when released there in 1989, it was rated by many motoring magazines, including the well-respected Wheels, as providing performance and handling equal or superior to that of European icons like the Porsche 911 and the Ferrari Testarossa, at a considerably lower price. The Skyline's home-market competitors have included the Honda NSX, Toyota Supra, Mitsubishi Lancer Evolution, Subaru Impreza WRX STi, and Mazda RX-7."
}, { 
    "make": "Lamborghini",
    "model":"Huracan STO",
    "year":"2021" ,
    "image":"https://i.imgur.com/dKr8IRO.jpg",
    "engine":"v10",
    "transmission":"Auto",
    "price":"509,991",
    "mileage":"69 miles",
    "description":"Available only as a two-door coupe, the 2022 Lamborghini Huracan STO is an exotic mid-engine sports car made for maximum performance on or off the racetrack. It comes with a 5.2-liter V10 engine (630 horsepower and 417-lb-ft of torque), a seven-speed dual-clutch automatic transmission and rear-wheel drive."
}, { 
    "make": "BMW",
    "model":"M4CS",
    "year":"2020" ,
    "image":"https://i.imgur.com/kdFj1Hk.jpg ",
    "engine":"il6",
    "transmission":"Auto",
    "price":"64,999",
    "mileage":"13k miles",
    "description":"BMW's M TwinPower Turbo technology allows the M4 CS to dip below the four-second benchmark for the 0 to 100 km/h (62 mph) sprint, stopping the clock at a breath taking 3.9 seconds. The top speed of the M4 CS, which comes as standard with the M Driver's Package, is electronically limited to 280 km/h (174 mph)."
}, { 
    "make": "Ferrari",
    "model":"458",
    "year":"2020" ,
    "image":"https://i.imgur.com/H31pNgI.jpg",
    "engine":"v8",
    "transmission":"auto",
    "price":"174,954",
    "mileage":"10k",
    "description":"Ferrari 458 Italia Coupe Engine and Performance Details The 458 is a work of art and aerodynamic efficiency, featuring a 4.5L naturally aspirated V8 engine that produces a stunning 562 hp at 9,000 RPM. The engine outputs 125 hp per liter, which is a record for the highest amount of power per naturally aspirated piston."
}, { 
    "make": "Porsche",
    "model":"GT3RS",
    "year":"2021" ,
    "image":"https://i.imgur.com/cA6hyke.jpg",
    "engine":"Flat Six",
    "transmission":"Auto",
    "mileage":"263,999",
    "price":"6k",
    "description":"A 4.0-liter high revving naturally aspirated 518 hp engine. Fully automatic adjustment of the front diffuser and rear wing. Drag Reduction System (DRS) — rear wing. Aero wishbone on the front axle for up to 88 lbs more downforce."
}, { 
    "make": "Porsche",
    "model":"911 Turbo S",
    "year":"2021" ,
    "image":"https://i.imgur.com/r629U0G.jpg",
    "engine":"Flat Six",
    "transmission":"Auto",
    "price":"252,982",
    "mileage":"2k",
    "description":"Engine, Transmission, and Performance Hanging out in the rear of both the Turbo and Turbo S is a twin-turbocharged 3.7-liter flat-six engine that makes up to 640 horsepower in the more powerful of the two variants; the regular Turbo model makes 572 horsepower."
}, { 
    "make": "BMW",
    "model":"M3 Lime Rock Park Edition",
    "year":"2010" ,
    "image":"https://i.imgur.com/wldKiaK.jpg",
    "engine":"V8",
    "transmission":"Auto",
    "price":"125,000",
    "mileage":"16k",
    "description":"This is what will set the E92 apart from all other M3's and made it special for performance enthusiasts around the globe. The BMW M3 E92 will forever be remembered as the classic M3 because it's the only V8-powered version and it's not coming back."
}, { 
    "make": "BMW",
    "model":"M2 Compititon",
    "year":"202" ,
    "image":"https://i.imgur.com/BJXxYOR.jpg",
    "engine":"il6'",
    "transmission":"auto",
    "price":"59,000",
    "mileage":"5k",
    "description":"The M2 is powered by the twin-turbo 3.0-litre BMW S58 straight-six engine rated at 338 kW (453 hp) at 6,250 rpm and 550 N⋅m (406 lb⋅ft) between 2,600 and 5,950 rpm. It remains rear-wheel drive and will be available with a 6-speed manual or with an 8-speed automatic."
}]